{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "J00",
    "1": "J01.00",
    "10": "J02.9",
    "100": "J96.90",
    "101": "J96.91",
    "102": "J98.01",
    "103": "J98.11",
    "104": "J98.4",
    "105": "J98.8",
    "11": "J03.00",
    "12": "J03.9",
    "13": "J03.90",
    "14": "J04.0",
    "15": "J05.0",
    "16": "J06.9",
    "17": "J09.X2",
    "18": "J10.1",
    "19": "J11.1",
    "2": "J01.01",
    "20": "J12.82",
    "21": "J12.89",
    "22": "J15.1",
    "23": "J15.212",
    "24": "J15.6",
    "25": "J15.9",
    "26": "J18",
    "27": "J18.0",
    "28": "J18.1",
    "29": "J18.8",
    "3": "J01.10",
    "30": "J18.9",
    "31": "J20.8",
    "32": "J20.9",
    "33": "J21.0",
    "34": "J21.9",
    "35": "J22",
    "36": "J30.0",
    "37": "J30.1",
    "38": "J30.2",
    "39": "J30.81",
    "4": "J01.40",
    "40": "J30.89",
    "41": "J30.9",
    "42": "J31.0",
    "43": "J32.0",
    "44": "J32.1",
    "45": "J32.2",
    "46": "J32.4",
    "47": "J32.8",
    "48": "J32.9",
    "49": "J34.2",
    "5": "J01.80",
    "50": "J34.3",
    "51": "J34.8",
    "52": "J34.89",
    "53": "J35.01",
    "54": "J35.1",
    "55": "J35.2",
    "56": "J35.3",
    "57": "J36",
    "58": "J40",
    "59": "J42",
    "6": "J01.9",
    "60": "J43.2",
    "61": "J43.9",
    "62": "J44.0",
    "63": "J44.1",
    "64": "J44.9",
    "65": "J45.20",
    "66": "J45.21",
    "67": "J45.30",
    "68": "J45.31",
    "69": "J45.40",
    "7": "J01.90",
    "70": "J45.41",
    "71": "J45.50",
    "72": "J45.51",
    "73": "J45.901",
    "74": "J45.909",
    "75": "J45.99",
    "76": "J45.998",
    "77": "J47.9",
    "78": "J69.0",
    "79": "J80",
    "8": "J02.0",
    "80": "J81.0",
    "81": "J81.1",
    "82": "J84.10",
    "83": "J84.112",
    "84": "J84.9",
    "85": "J86.9",
    "86": "J90",
    "87": "J91.0",
    "88": "J91.8",
    "89": "J93.9",
    "9": "J02.8",
    "90": "J95.811",
    "91": "J95.821",
    "92": "J96.00",
    "93": "J96.01",
    "94": "J96.02",
    "95": "J96.10",
    "96": "J96.11",
    "97": "J96.20",
    "98": "J96.21",
    "99": "J96.22"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "J00": 0,
    "J01.00": 1,
    "J01.01": 2,
    "J01.10": 3,
    "J01.40": 4,
    "J01.80": 5,
    "J01.9": 6,
    "J01.90": 7,
    "J02.0": 8,
    "J02.8": 9,
    "J02.9": 10,
    "J03.00": 11,
    "J03.9": 12,
    "J03.90": 13,
    "J04.0": 14,
    "J05.0": 15,
    "J06.9": 16,
    "J09.X2": 17,
    "J10.1": 18,
    "J11.1": 19,
    "J12.82": 20,
    "J12.89": 21,
    "J15.1": 22,
    "J15.212": 23,
    "J15.6": 24,
    "J15.9": 25,
    "J18": 26,
    "J18.0": 27,
    "J18.1": 28,
    "J18.8": 29,
    "J18.9": 30,
    "J20.8": 31,
    "J20.9": 32,
    "J21.0": 33,
    "J21.9": 34,
    "J22": 35,
    "J30.0": 36,
    "J30.1": 37,
    "J30.2": 38,
    "J30.81": 39,
    "J30.89": 40,
    "J30.9": 41,
    "J31.0": 42,
    "J32.0": 43,
    "J32.1": 44,
    "J32.2": 45,
    "J32.4": 46,
    "J32.8": 47,
    "J32.9": 48,
    "J34.2": 49,
    "J34.3": 50,
    "J34.8": 51,
    "J34.89": 52,
    "J35.01": 53,
    "J35.1": 54,
    "J35.2": 55,
    "J35.3": 56,
    "J36": 57,
    "J40": 58,
    "J42": 59,
    "J43.2": 60,
    "J43.9": 61,
    "J44.0": 62,
    "J44.1": 63,
    "J44.9": 64,
    "J45.20": 65,
    "J45.21": 66,
    "J45.30": 67,
    "J45.31": 68,
    "J45.40": 69,
    "J45.41": 70,
    "J45.50": 71,
    "J45.51": 72,
    "J45.901": 73,
    "J45.909": 74,
    "J45.99": 75,
    "J45.998": 76,
    "J47.9": 77,
    "J69.0": 78,
    "J80": 79,
    "J81.0": 80,
    "J81.1": 81,
    "J84.10": 82,
    "J84.112": 83,
    "J84.9": 84,
    "J86.9": 85,
    "J90": 86,
    "J91.0": 87,
    "J91.8": 88,
    "J93.9": 89,
    "J95.811": 90,
    "J95.821": 91,
    "J96.00": 92,
    "J96.01": 93,
    "J96.02": 94,
    "J96.10": 95,
    "J96.11": 96,
    "J96.20": 97,
    "J96.21": 98,
    "J96.22": 99,
    "J96.90": 100,
    "J96.91": 101,
    "J98.01": 102,
    "J98.11": 103,
    "J98.4": 104,
    "J98.8": 105
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
