{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "A04.72",
    "1": "A08.4",
    "10": "A64",
    "11": "A69.20",
    "2": "A09",
    "3": "A41.01",
    "4": "A41.02",
    "5": "A41.51",
    "6": "A41.59",
    "7": "A41.89",
    "8": "A41.9",
    "9": "A63.0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "A04.72": 0,
    "A08.4": 1,
    "A09": 2,
    "A41.01": 3,
    "A41.02": 4,
    "A41.51": 5,
    "A41.59": 6,
    "A41.89": 7,
    "A41.9": 8,
    "A63.0": 9,
    "A64": 10,
    "A69.20": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
