{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "S00.03XA",
    "1": "S00.81XA",
    "10": "S05.02XA",
    "11": "S06.0X0A",
    "12": "S09.8XXA",
    "13": "S09.90XA",
    "14": "S13.4XXA",
    "15": "S13.4XXD",
    "16": "S16.1XXA",
    "17": "S16.1XXD",
    "18": "S19.9XXA",
    "19": "S20.211A",
    "2": "S00.83XA",
    "20": "S20.212A",
    "21": "S20.219A",
    "22": "S22.31XA",
    "23": "S22.32XA",
    "24": "S22.41XA",
    "25": "S22.42XA",
    "26": "S23.3XXA",
    "27": "S27.0XXA",
    "28": "S29.012A",
    "29": "S29.9XXA",
    "3": "S01.01XA",
    "30": "S30.0XXA",
    "31": "S33.5XXA",
    "32": "S33.5XXD",
    "33": "S33.6XXA",
    "34": "S33.8XXA",
    "35": "S39.012A",
    "36": "S39.012D",
    "37": "S43.431A",
    "38": "S46.011A",
    "39": "S46.011D",
    "4": "S01.111A",
    "40": "S46.012A",
    "41": "S52.501A",
    "42": "S52.501D",
    "43": "S52.502A",
    "44": "S52.502D",
    "45": "S52.571A",
    "46": "S52.572A",
    "47": "S61.012A",
    "48": "S61.211A",
    "49": "S61.411A",
    "5": "S01.112A",
    "50": "S61.412A",
    "51": "S63.501A",
    "52": "S63.502A",
    "53": "S69.91XA",
    "54": "S69.92XA",
    "55": "S72.001A",
    "56": "S72.001D",
    "57": "S72.002A",
    "58": "S72.002D",
    "59": "S72.141A",
    "6": "S01.511A",
    "60": "S72.142A",
    "61": "S80.01XA",
    "62": "S80.02XA",
    "63": "S81.811A",
    "64": "S81.812A",
    "65": "S82.841A",
    "66": "S82.851A",
    "67": "S83.231A",
    "68": "S83.232A",
    "69": "S83.241A",
    "7": "S01.81XA",
    "70": "S83.242A",
    "71": "S83.242D",
    "72": "S83.281A",
    "73": "S83.511A",
    "74": "S83.511D",
    "75": "S83.512A",
    "76": "S83.512D",
    "77": "S83.91XA",
    "78": "S83.92XA",
    "79": "S89.91XA",
    "8": "S02.2XXA",
    "80": "S89.92XA",
    "81": "S93.401A",
    "82": "S93.401D",
    "83": "S93.402A",
    "84": "S99.911A",
    "85": "S99.921A",
    "86": "S99.922A",
    "9": "S05.01XA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "S00.03XA": 0,
    "S00.81XA": 1,
    "S00.83XA": 2,
    "S01.01XA": 3,
    "S01.111A": 4,
    "S01.112A": 5,
    "S01.511A": 6,
    "S01.81XA": 7,
    "S02.2XXA": 8,
    "S05.01XA": 9,
    "S05.02XA": 10,
    "S06.0X0A": 11,
    "S09.8XXA": 12,
    "S09.90XA": 13,
    "S13.4XXA": 14,
    "S13.4XXD": 15,
    "S16.1XXA": 16,
    "S16.1XXD": 17,
    "S19.9XXA": 18,
    "S20.211A": 19,
    "S20.212A": 20,
    "S20.219A": 21,
    "S22.31XA": 22,
    "S22.32XA": 23,
    "S22.41XA": 24,
    "S22.42XA": 25,
    "S23.3XXA": 26,
    "S27.0XXA": 27,
    "S29.012A": 28,
    "S29.9XXA": 29,
    "S30.0XXA": 30,
    "S33.5XXA": 31,
    "S33.5XXD": 32,
    "S33.6XXA": 33,
    "S33.8XXA": 34,
    "S39.012A": 35,
    "S39.012D": 36,
    "S43.431A": 37,
    "S46.011A": 38,
    "S46.011D": 39,
    "S46.012A": 40,
    "S52.501A": 41,
    "S52.501D": 42,
    "S52.502A": 43,
    "S52.502D": 44,
    "S52.571A": 45,
    "S52.572A": 46,
    "S61.012A": 47,
    "S61.211A": 48,
    "S61.411A": 49,
    "S61.412A": 50,
    "S63.501A": 51,
    "S63.502A": 52,
    "S69.91XA": 53,
    "S69.92XA": 54,
    "S72.001A": 55,
    "S72.001D": 56,
    "S72.002A": 57,
    "S72.002D": 58,
    "S72.141A": 59,
    "S72.142A": 60,
    "S80.01XA": 61,
    "S80.02XA": 62,
    "S81.811A": 63,
    "S81.812A": 64,
    "S82.841A": 65,
    "S82.851A": 66,
    "S83.231A": 67,
    "S83.232A": 68,
    "S83.241A": 69,
    "S83.242A": 70,
    "S83.242D": 71,
    "S83.281A": 72,
    "S83.511A": 73,
    "S83.511D": 74,
    "S83.512A": 75,
    "S83.512D": 76,
    "S83.91XA": 77,
    "S83.92XA": 78,
    "S89.91XA": 79,
    "S89.92XA": 80,
    "S93.401A": 81,
    "S93.401D": 82,
    "S93.402A": 83,
    "S99.911A": 84,
    "S99.921A": 85,
    "S99.922A": 86
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
