{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I07.1",
    "1": "I08.0",
    "10": "I13.10",
    "100": "I63.89",
    "101": "I63.9",
    "102": "I65.21",
    "103": "I65.22",
    "104": "I65.23",
    "105": "I65.29",
    "106": "I67.1",
    "107": "I67.89",
    "108": "I67.9",
    "109": "I69.320",
    "11": "I13.2",
    "110": "I69.351",
    "111": "I69.354",
    "112": "I69.39",
    "113": "I69.391",
    "114": "I69.398",
    "115": "I70.0",
    "116": "I70.203",
    "117": "I70.213",
    "118": "I71.2",
    "119": "I71.4",
    "12": "I16.0",
    "120": "I73.00",
    "121": "I73.89",
    "122": "I73.9",
    "123": "I74.3",
    "124": "I77.6",
    "125": "I81",
    "126": "I82.401",
    "127": "I82.402",
    "128": "I82.409",
    "129": "I82.411",
    "13": "I16.1",
    "130": "I82.412",
    "131": "I82.432",
    "132": "I83.813",
    "133": "I83.893",
    "134": "I85.00",
    "135": "I87.1",
    "136": "I87.2",
    "137": "I87.8",
    "138": "I89.0",
    "139": "I95.1",
    "14": "I20.0",
    "140": "I95.89",
    "141": "I95.9",
    "142": "I96",
    "15": "I20.8",
    "16": "I20.9",
    "17": "I21.09",
    "18": "I21.19",
    "19": "I21.3",
    "2": "I08.1",
    "20": "I21.4",
    "21": "I21.A1",
    "22": "I24.8",
    "23": "I24.9",
    "24": "I25.10",
    "25": "I25.110",
    "26": "I25.118",
    "27": "I25.119",
    "28": "I25.2",
    "29": "I25.5",
    "3": "I08.3",
    "30": "I25.810",
    "31": "I25.82",
    "32": "I25.9",
    "33": "I26.99",
    "34": "I27.0",
    "35": "I27.2",
    "36": "I27.20",
    "37": "I27.29",
    "38": "I31.3",
    "39": "I33.0",
    "4": "I10",
    "40": "I34.0",
    "41": "I34.1",
    "42": "I35.0",
    "43": "I35.1",
    "44": "I35.9",
    "45": "I36.1",
    "46": "I38",
    "47": "I42.0",
    "48": "I42.2",
    "49": "I42.8",
    "5": "I11.0",
    "50": "I42.9",
    "51": "I44.0",
    "52": "I44.1",
    "53": "I44.2",
    "54": "I44.7",
    "55": "I45.10",
    "56": "I45.2",
    "57": "I46.9",
    "58": "I47.1",
    "59": "I47.2",
    "6": "I11.9",
    "60": "I48.0",
    "61": "I48.1",
    "62": "I48.19",
    "63": "I48.2",
    "64": "I48.20",
    "65": "I48.21",
    "66": "I48.3",
    "67": "I48.4",
    "68": "I48.91",
    "69": "I48.92",
    "7": "I12.0",
    "70": "I49.01",
    "71": "I49.1",
    "72": "I49.3",
    "73": "I49.5",
    "74": "I49.8",
    "75": "I49.9",
    "76": "I50.20",
    "77": "I50.21",
    "78": "I50.22",
    "79": "I50.23",
    "8": "I12.9",
    "80": "I50.30",
    "81": "I50.31",
    "82": "I50.32",
    "83": "I50.33",
    "84": "I50.41",
    "85": "I50.42",
    "86": "I50.43",
    "87": "I50.9",
    "88": "I51.7",
    "89": "I51.9",
    "9": "I13.0",
    "90": "I60.9",
    "91": "I61.9",
    "92": "I62.00",
    "93": "I62.9",
    "94": "I63.40",
    "95": "I63.412",
    "96": "I63.50",
    "97": "I63.511",
    "98": "I63.512",
    "99": "I63.8"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "I07.1": 0,
    "I08.0": 1,
    "I08.1": 2,
    "I08.3": 3,
    "I10": 4,
    "I11.0": 5,
    "I11.9": 6,
    "I12.0": 7,
    "I12.9": 8,
    "I13.0": 9,
    "I13.10": 10,
    "I13.2": 11,
    "I16.0": 12,
    "I16.1": 13,
    "I20.0": 14,
    "I20.8": 15,
    "I20.9": 16,
    "I21.09": 17,
    "I21.19": 18,
    "I21.3": 19,
    "I21.4": 20,
    "I21.A1": 21,
    "I24.8": 22,
    "I24.9": 23,
    "I25.10": 24,
    "I25.110": 25,
    "I25.118": 26,
    "I25.119": 27,
    "I25.2": 28,
    "I25.5": 29,
    "I25.810": 30,
    "I25.82": 31,
    "I25.9": 32,
    "I26.99": 33,
    "I27.0": 34,
    "I27.2": 35,
    "I27.20": 36,
    "I27.29": 37,
    "I31.3": 38,
    "I33.0": 39,
    "I34.0": 40,
    "I34.1": 41,
    "I35.0": 42,
    "I35.1": 43,
    "I35.9": 44,
    "I36.1": 45,
    "I38": 46,
    "I42.0": 47,
    "I42.2": 48,
    "I42.8": 49,
    "I42.9": 50,
    "I44.0": 51,
    "I44.1": 52,
    "I44.2": 53,
    "I44.7": 54,
    "I45.10": 55,
    "I45.2": 56,
    "I46.9": 57,
    "I47.1": 58,
    "I47.2": 59,
    "I48.0": 60,
    "I48.1": 61,
    "I48.19": 62,
    "I48.2": 63,
    "I48.20": 64,
    "I48.21": 65,
    "I48.3": 66,
    "I48.4": 67,
    "I48.91": 68,
    "I48.92": 69,
    "I49.01": 70,
    "I49.1": 71,
    "I49.3": 72,
    "I49.5": 73,
    "I49.8": 74,
    "I49.9": 75,
    "I50.20": 76,
    "I50.21": 77,
    "I50.22": 78,
    "I50.23": 79,
    "I50.30": 80,
    "I50.31": 81,
    "I50.32": 82,
    "I50.33": 83,
    "I50.41": 84,
    "I50.42": 85,
    "I50.43": 86,
    "I50.9": 87,
    "I51.7": 88,
    "I51.9": 89,
    "I60.9": 90,
    "I61.9": 91,
    "I62.00": 92,
    "I62.9": 93,
    "I63.40": 94,
    "I63.412": 95,
    "I63.50": 96,
    "I63.511": 97,
    "I63.512": 98,
    "I63.8": 99,
    "I63.89": 100,
    "I63.9": 101,
    "I65.21": 102,
    "I65.22": 103,
    "I65.23": 104,
    "I65.29": 105,
    "I67.1": 106,
    "I67.89": 107,
    "I67.9": 108,
    "I69.320": 109,
    "I69.351": 110,
    "I69.354": 111,
    "I69.39": 112,
    "I69.391": 113,
    "I69.398": 114,
    "I70.0": 115,
    "I70.203": 116,
    "I70.213": 117,
    "I71.2": 118,
    "I71.4": 119,
    "I73.00": 120,
    "I73.89": 121,
    "I73.9": 122,
    "I74.3": 123,
    "I77.6": 124,
    "I81": 125,
    "I82.401": 126,
    "I82.402": 127,
    "I82.409": 128,
    "I82.411": 129,
    "I82.412": 130,
    "I82.432": 131,
    "I83.813": 132,
    "I83.893": 133,
    "I85.00": 134,
    "I87.1": 135,
    "I87.2": 136,
    "I87.8": 137,
    "I89.0": 138,
    "I95.1": 139,
    "I95.89": 140,
    "I95.9": 141,
    "I96": 142
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
