{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "M00.9",
    "1": "M05.79",
    "10": "M12.9",
    "100": "M50.10",
    "101": "M50.12",
    "102": "M50.122",
    "103": "M50.13",
    "104": "M50.20",
    "105": "M50.30",
    "106": "M50.32",
    "107": "M50.322",
    "108": "M51.06",
    "109": "M51.16",
    "11": "M13.0",
    "110": "M51.17",
    "111": "M51.26",
    "112": "M51.27",
    "113": "M51.34",
    "114": "M51.36",
    "115": "M51.37",
    "116": "M53.0",
    "117": "M53.1",
    "118": "M53.3",
    "119": "M53.82",
    "12": "M15.0",
    "120": "M53.86",
    "121": "M54.10",
    "122": "M54.12",
    "123": "M54.13",
    "124": "M54.14",
    "125": "M54.16",
    "126": "M54.17",
    "127": "M54.2",
    "128": "M54.30",
    "129": "M54.31",
    "13": "M15.9",
    "130": "M54.32",
    "131": "M54.40",
    "132": "M54.41",
    "133": "M54.42",
    "134": "M54.5",
    "135": "M54.50",
    "136": "M54.6",
    "137": "M54.81",
    "138": "M54.89",
    "139": "M54.9",
    "14": "M16.0",
    "140": "M60.9",
    "141": "M62.50",
    "142": "M62.8",
    "143": "M62.81",
    "144": "M62.82",
    "145": "M62.830",
    "146": "M62.838",
    "147": "M62.89",
    "148": "M65.311",
    "149": "M65.331",
    "15": "M16.11",
    "150": "M65.332",
    "151": "M65.341",
    "152": "M65.4",
    "153": "M65.9",
    "154": "M70.61",
    "155": "M70.62",
    "156": "M72.0",
    "157": "M72.2",
    "158": "M75.01",
    "159": "M75.02",
    "16": "M16.12",
    "160": "M75.101",
    "161": "M75.102",
    "162": "M75.111",
    "163": "M75.112",
    "164": "M75.121",
    "165": "M75.122",
    "166": "M75.21",
    "167": "M75.22",
    "168": "M75.41",
    "169": "M75.42",
    "17": "M17.0",
    "170": "M75.51",
    "171": "M75.52",
    "172": "M75.81",
    "173": "M75.82",
    "174": "M76.61",
    "175": "M76.62",
    "176": "M76.821",
    "177": "M76.822",
    "178": "M77.01",
    "179": "M77.11",
    "18": "M17.10",
    "180": "M77.12",
    "181": "M77.31",
    "182": "M77.32",
    "183": "M77.41",
    "184": "M77.8",
    "185": "M77.9",
    "186": "M79.1",
    "187": "M79.10",
    "188": "M79.18",
    "189": "M79.2",
    "19": "M17.11",
    "190": "M79.601",
    "191": "M79.602",
    "192": "M79.604",
    "193": "M79.605",
    "194": "M79.606",
    "195": "M79.609",
    "196": "M79.641",
    "197": "M79.642",
    "198": "M79.644",
    "199": "M79.645",
    "2": "M05.89",
    "20": "M17.12",
    "200": "M79.651",
    "201": "M79.652",
    "202": "M79.661",
    "203": "M79.662",
    "204": "M79.671",
    "205": "M79.672",
    "206": "M79.673",
    "207": "M79.674",
    "208": "M79.675",
    "209": "M79.7",
    "21": "M17.9",
    "210": "M79.89",
    "211": "M81.0",
    "212": "M81.8",
    "213": "M85.80",
    "214": "M85.88",
    "215": "M85.89",
    "216": "M86.171",
    "217": "M86.172",
    "218": "M86.8X7",
    "219": "M86.9",
    "22": "M18.11",
    "220": "M89.9",
    "221": "M94.0",
    "222": "M96.1",
    "223": "M99.00",
    "224": "M99.01",
    "225": "M99.02",
    "226": "M99.03",
    "227": "M99.04",
    "228": "M99.05",
    "229": "M99.06",
    "23": "M18.12",
    "230": "M99.11",
    "24": "M19.011",
    "25": "M19.012",
    "26": "M19.041",
    "27": "M19.042",
    "28": "M19.071",
    "29": "M19.072",
    "3": "M05.9",
    "30": "M19.90",
    "31": "M20.11",
    "32": "M20.12",
    "33": "M20.21",
    "34": "M20.41",
    "35": "M20.42",
    "36": "M21.371",
    "37": "M22.2X1",
    "38": "M22.2X2",
    "39": "M22.41",
    "4": "M06.00",
    "40": "M22.42",
    "41": "M25.311",
    "42": "M25.461",
    "43": "M25.462",
    "44": "M25.50",
    "45": "M25.511",
    "46": "M25.512",
    "47": "M25.519",
    "48": "M25.521",
    "49": "M25.522",
    "5": "M06.09",
    "50": "M25.531",
    "51": "M25.532",
    "52": "M25.541",
    "53": "M25.551",
    "54": "M25.552",
    "55": "M25.559",
    "56": "M25.561",
    "57": "M25.562",
    "58": "M25.569",
    "59": "M25.571",
    "6": "M06.4",
    "60": "M25.572",
    "61": "M25.579",
    "62": "M25.60",
    "63": "M25.611",
    "64": "M25.612",
    "65": "M25.661",
    "66": "M25.662",
    "67": "M31.6",
    "68": "M32.10",
    "69": "M32.14",
    "7": "M06.9",
    "70": "M32.9",
    "71": "M34.9",
    "72": "M35.00",
    "73": "M35.3",
    "74": "M35.9",
    "75": "M41.9",
    "76": "M43.06",
    "77": "M43.16",
    "78": "M43.17",
    "79": "M43.6",
    "8": "M10.00",
    "80": "M45.9",
    "81": "M46.1",
    "82": "M47.12",
    "83": "M47.22",
    "84": "M47.26",
    "85": "M47.27",
    "86": "M47.812",
    "87": "M47.814",
    "88": "M47.816",
    "89": "M47.817",
    "9": "M10.9",
    "90": "M47.892",
    "91": "M47.896",
    "92": "M48.00",
    "93": "M48.02",
    "94": "M48.06",
    "95": "M48.061",
    "96": "M48.062",
    "97": "M48.07",
    "98": "M48.54XA",
    "99": "M48.56XA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "M00.9": 0,
    "M05.79": 1,
    "M05.89": 2,
    "M05.9": 3,
    "M06.00": 4,
    "M06.09": 5,
    "M06.4": 6,
    "M06.9": 7,
    "M10.00": 8,
    "M10.9": 9,
    "M12.9": 10,
    "M13.0": 11,
    "M15.0": 12,
    "M15.9": 13,
    "M16.0": 14,
    "M16.11": 15,
    "M16.12": 16,
    "M17.0": 17,
    "M17.10": 18,
    "M17.11": 19,
    "M17.12": 20,
    "M17.9": 21,
    "M18.11": 22,
    "M18.12": 23,
    "M19.011": 24,
    "M19.012": 25,
    "M19.041": 26,
    "M19.042": 27,
    "M19.071": 28,
    "M19.072": 29,
    "M19.90": 30,
    "M20.11": 31,
    "M20.12": 32,
    "M20.21": 33,
    "M20.41": 34,
    "M20.42": 35,
    "M21.371": 36,
    "M22.2X1": 37,
    "M22.2X2": 38,
    "M22.41": 39,
    "M22.42": 40,
    "M25.311": 41,
    "M25.461": 42,
    "M25.462": 43,
    "M25.50": 44,
    "M25.511": 45,
    "M25.512": 46,
    "M25.519": 47,
    "M25.521": 48,
    "M25.522": 49,
    "M25.531": 50,
    "M25.532": 51,
    "M25.541": 52,
    "M25.551": 53,
    "M25.552": 54,
    "M25.559": 55,
    "M25.561": 56,
    "M25.562": 57,
    "M25.569": 58,
    "M25.571": 59,
    "M25.572": 60,
    "M25.579": 61,
    "M25.60": 62,
    "M25.611": 63,
    "M25.612": 64,
    "M25.661": 65,
    "M25.662": 66,
    "M31.6": 67,
    "M32.10": 68,
    "M32.14": 69,
    "M32.9": 70,
    "M34.9": 71,
    "M35.00": 72,
    "M35.3": 73,
    "M35.9": 74,
    "M41.9": 75,
    "M43.06": 76,
    "M43.16": 77,
    "M43.17": 78,
    "M43.6": 79,
    "M45.9": 80,
    "M46.1": 81,
    "M47.12": 82,
    "M47.22": 83,
    "M47.26": 84,
    "M47.27": 85,
    "M47.812": 86,
    "M47.814": 87,
    "M47.816": 88,
    "M47.817": 89,
    "M47.892": 90,
    "M47.896": 91,
    "M48.00": 92,
    "M48.02": 93,
    "M48.06": 94,
    "M48.061": 95,
    "M48.062": 96,
    "M48.07": 97,
    "M48.54XA": 98,
    "M48.56XA": 99,
    "M50.10": 100,
    "M50.12": 101,
    "M50.122": 102,
    "M50.13": 103,
    "M50.20": 104,
    "M50.30": 105,
    "M50.32": 106,
    "M50.322": 107,
    "M51.06": 108,
    "M51.16": 109,
    "M51.17": 110,
    "M51.26": 111,
    "M51.27": 112,
    "M51.34": 113,
    "M51.36": 114,
    "M51.37": 115,
    "M53.0": 116,
    "M53.1": 117,
    "M53.3": 118,
    "M53.82": 119,
    "M53.86": 120,
    "M54.10": 121,
    "M54.12": 122,
    "M54.13": 123,
    "M54.14": 124,
    "M54.16": 125,
    "M54.17": 126,
    "M54.2": 127,
    "M54.30": 128,
    "M54.31": 129,
    "M54.32": 130,
    "M54.40": 131,
    "M54.41": 132,
    "M54.42": 133,
    "M54.5": 134,
    "M54.50": 135,
    "M54.6": 136,
    "M54.81": 137,
    "M54.89": 138,
    "M54.9": 139,
    "M60.9": 140,
    "M62.50": 141,
    "M62.8": 142,
    "M62.81": 143,
    "M62.82": 144,
    "M62.830": 145,
    "M62.838": 146,
    "M62.89": 147,
    "M65.311": 148,
    "M65.331": 149,
    "M65.332": 150,
    "M65.341": 151,
    "M65.4": 152,
    "M65.9": 153,
    "M70.61": 154,
    "M70.62": 155,
    "M72.0": 156,
    "M72.2": 157,
    "M75.01": 158,
    "M75.02": 159,
    "M75.101": 160,
    "M75.102": 161,
    "M75.111": 162,
    "M75.112": 163,
    "M75.121": 164,
    "M75.122": 165,
    "M75.21": 166,
    "M75.22": 167,
    "M75.41": 168,
    "M75.42": 169,
    "M75.51": 170,
    "M75.52": 171,
    "M75.81": 172,
    "M75.82": 173,
    "M76.61": 174,
    "M76.62": 175,
    "M76.821": 176,
    "M76.822": 177,
    "M77.01": 178,
    "M77.11": 179,
    "M77.12": 180,
    "M77.31": 181,
    "M77.32": 182,
    "M77.41": 183,
    "M77.8": 184,
    "M77.9": 185,
    "M79.1": 186,
    "M79.10": 187,
    "M79.18": 188,
    "M79.2": 189,
    "M79.601": 190,
    "M79.602": 191,
    "M79.604": 192,
    "M79.605": 193,
    "M79.606": 194,
    "M79.609": 195,
    "M79.641": 196,
    "M79.642": 197,
    "M79.644": 198,
    "M79.645": 199,
    "M79.651": 200,
    "M79.652": 201,
    "M79.661": 202,
    "M79.662": 203,
    "M79.671": 204,
    "M79.672": 205,
    "M79.673": 206,
    "M79.674": 207,
    "M79.675": 208,
    "M79.7": 209,
    "M79.89": 210,
    "M81.0": 211,
    "M81.8": 212,
    "M85.80": 213,
    "M85.88": 214,
    "M85.89": 215,
    "M86.171": 216,
    "M86.172": 217,
    "M86.8X7": 218,
    "M86.9": 219,
    "M89.9": 220,
    "M94.0": 221,
    "M96.1": 222,
    "M99.00": 223,
    "M99.01": 224,
    "M99.02": 225,
    "M99.03": 226,
    "M99.04": 227,
    "M99.05": 228,
    "M99.06": 229,
    "M99.11": 230
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
