{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "L01.00",
    "1": "L02.211",
    "10": "L03.032",
    "11": "L03.113",
    "12": "L03.114",
    "13": "L03.115",
    "14": "L03.116",
    "15": "L03.119",
    "16": "L03.211",
    "17": "L03.311",
    "18": "L03.90",
    "19": "L05.01",
    "2": "L02.214",
    "20": "L05.91",
    "21": "L08.9",
    "22": "L20.84",
    "23": "L20.89",
    "24": "L20.9",
    "25": "L21.8",
    "26": "L21.9",
    "27": "L22",
    "28": "L23.7",
    "29": "L23.9",
    "3": "L02.31",
    "30": "L25.9",
    "31": "L29.9",
    "32": "L30.8",
    "33": "L30.9",
    "34": "L40.0",
    "35": "L40.50",
    "36": "L40.59",
    "37": "L40.9",
    "38": "L50.0",
    "39": "L50.1",
    "4": "L02.415",
    "40": "L50.8",
    "41": "L50.9",
    "42": "L57.0",
    "43": "L57.8",
    "44": "L60.0",
    "45": "L60.3",
    "46": "L65.9",
    "47": "L70.0",
    "48": "L70.8",
    "49": "L70.9",
    "5": "L02.416",
    "50": "L71.8",
    "51": "L71.9",
    "52": "L72.0",
    "53": "L72.3",
    "54": "L72.8",
    "55": "L73.2",
    "56": "L73.8",
    "57": "L73.9",
    "58": "L80",
    "59": "L81.4",
    "6": "L02.91",
    "60": "L82.0",
    "61": "L82.1",
    "62": "L84",
    "63": "L85.3",
    "64": "L89.152",
    "65": "L89.153",
    "66": "L89.154",
    "67": "L90.5",
    "68": "L91.0",
    "69": "L91.8",
    "7": "L03.011",
    "70": "L97.512",
    "71": "L97.519",
    "72": "L97.522",
    "73": "L97.529",
    "74": "L98.8",
    "75": "L98.9",
    "8": "L03.012",
    "9": "L03.031"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "L01.00": 0,
    "L02.211": 1,
    "L02.214": 2,
    "L02.31": 3,
    "L02.415": 4,
    "L02.416": 5,
    "L02.91": 6,
    "L03.011": 7,
    "L03.012": 8,
    "L03.031": 9,
    "L03.032": 10,
    "L03.113": 11,
    "L03.114": 12,
    "L03.115": 13,
    "L03.116": 14,
    "L03.119": 15,
    "L03.211": 16,
    "L03.311": 17,
    "L03.90": 18,
    "L05.01": 19,
    "L05.91": 20,
    "L08.9": 21,
    "L20.84": 22,
    "L20.89": 23,
    "L20.9": 24,
    "L21.8": 25,
    "L21.9": 26,
    "L22": 27,
    "L23.7": 28,
    "L23.9": 29,
    "L25.9": 30,
    "L29.9": 31,
    "L30.8": 32,
    "L30.9": 33,
    "L40.0": 34,
    "L40.50": 35,
    "L40.59": 36,
    "L40.9": 37,
    "L50.0": 38,
    "L50.1": 39,
    "L50.8": 40,
    "L50.9": 41,
    "L57.0": 42,
    "L57.8": 43,
    "L60.0": 44,
    "L60.3": 45,
    "L65.9": 46,
    "L70.0": 47,
    "L70.8": 48,
    "L70.9": 49,
    "L71.8": 50,
    "L71.9": 51,
    "L72.0": 52,
    "L72.3": 53,
    "L72.8": 54,
    "L73.2": 55,
    "L73.8": 56,
    "L73.9": 57,
    "L80": 58,
    "L81.4": 59,
    "L82.0": 60,
    "L82.1": 61,
    "L84": 62,
    "L85.3": 63,
    "L89.152": 64,
    "L89.153": 65,
    "L89.154": 66,
    "L90.5": 67,
    "L91.0": 68,
    "L91.8": 69,
    "L97.512": 70,
    "L97.519": 71,
    "L97.522": 72,
    "L97.529": 73,
    "L98.8": 74,
    "L98.9": 75
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
