{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "E03.4",
    "1": "E03.8",
    "10": "E10.10",
    "11": "E10.22",
    "12": "E10.40",
    "13": "E10.649",
    "14": "E10.65",
    "15": "E10.8",
    "16": "E10.9",
    "17": "E11.00",
    "18": "E11.10",
    "19": "E11.21",
    "2": "E03.9",
    "20": "E11.22",
    "21": "E11.29",
    "22": "E11.319",
    "23": "E11.3293",
    "24": "E11.3513",
    "25": "E11.36",
    "26": "E11.40",
    "27": "E11.42",
    "28": "E11.43",
    "29": "E11.49",
    "3": "E04.1",
    "30": "E11.51",
    "31": "E11.52",
    "32": "E11.59",
    "33": "E11.621",
    "34": "E11.622",
    "35": "E11.628",
    "36": "E11.649",
    "37": "E11.65",
    "38": "E11.69",
    "39": "E11.8",
    "4": "E04.2",
    "40": "E11.9",
    "41": "E13.10",
    "42": "E13.9",
    "43": "E16.2",
    "44": "E21.0",
    "45": "E21.3",
    "46": "E22.2",
    "47": "E23.0",
    "48": "E27.40",
    "49": "E27.9",
    "5": "E04.9",
    "50": "E28.2",
    "51": "E29.1",
    "52": "E34.9",
    "53": "E43",
    "54": "E44.0",
    "55": "E44.1",
    "56": "E46",
    "57": "E53.8",
    "58": "E53.9",
    "59": "E55.9",
    "6": "E05.00",
    "60": "E56.9",
    "61": "E61.1",
    "62": "E66.01",
    "63": "E66.09",
    "64": "E66.2",
    "65": "E66.3",
    "66": "E66.9",
    "67": "E78.00",
    "68": "E78.1",
    "69": "E78.2",
    "7": "E05.90",
    "70": "E78.49",
    "71": "E78.5",
    "72": "E78.9",
    "73": "E83.110",
    "74": "E83.119",
    "75": "E87.70",
    "8": "E06.3",
    "9": "E07.9"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "E03.4": 0,
    "E03.8": 1,
    "E03.9": 2,
    "E04.1": 3,
    "E04.2": 4,
    "E04.9": 5,
    "E05.00": 6,
    "E05.90": 7,
    "E06.3": 8,
    "E07.9": 9,
    "E10.10": 10,
    "E10.22": 11,
    "E10.40": 12,
    "E10.649": 13,
    "E10.65": 14,
    "E10.8": 15,
    "E10.9": 16,
    "E11.00": 17,
    "E11.10": 18,
    "E11.21": 19,
    "E11.22": 20,
    "E11.29": 21,
    "E11.319": 22,
    "E11.3293": 23,
    "E11.3513": 24,
    "E11.36": 25,
    "E11.40": 26,
    "E11.42": 27,
    "E11.43": 28,
    "E11.49": 29,
    "E11.51": 30,
    "E11.52": 31,
    "E11.59": 32,
    "E11.621": 33,
    "E11.622": 34,
    "E11.628": 35,
    "E11.649": 36,
    "E11.65": 37,
    "E11.69": 38,
    "E11.8": 39,
    "E11.9": 40,
    "E13.10": 41,
    "E13.9": 42,
    "E16.2": 43,
    "E21.0": 44,
    "E21.3": 45,
    "E22.2": 46,
    "E23.0": 47,
    "E27.40": 48,
    "E27.9": 49,
    "E28.2": 50,
    "E29.1": 51,
    "E34.9": 52,
    "E43": 53,
    "E44.0": 54,
    "E44.1": 55,
    "E46": 56,
    "E53.8": 57,
    "E53.9": 58,
    "E55.9": 59,
    "E56.9": 60,
    "E61.1": 61,
    "E66.01": 62,
    "E66.09": 63,
    "E66.2": 64,
    "E66.3": 65,
    "E66.9": 66,
    "E78.00": 67,
    "E78.1": 68,
    "E78.2": 69,
    "E78.49": 70,
    "E78.5": 71,
    "E78.9": 72,
    "E83.110": 73,
    "E83.119": 74,
    "E87.70": 75
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
