{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "C01",
    "1": "C09.9",
    "10": "C18.7",
    "100": "C92.00",
    "101": "C92.01",
    "102": "C92.10",
    "11": "C18.9",
    "12": "C19",
    "13": "C20",
    "14": "C21.0",
    "15": "C22.0",
    "16": "C22.1",
    "17": "C25.0",
    "18": "C25.1",
    "19": "C25.9",
    "2": "C15.5",
    "20": "C34.11",
    "21": "C34.12",
    "22": "C34.2",
    "23": "C34.31",
    "24": "C34.32",
    "25": "C34.90",
    "26": "C34.91",
    "27": "C34.92",
    "28": "C43.59",
    "29": "C43.9",
    "3": "C15.9",
    "30": "C44.311",
    "31": "C44.319",
    "32": "C44.329",
    "33": "C44.41",
    "34": "C44.42",
    "35": "C44.519",
    "36": "C44.622",
    "37": "C44.629",
    "38": "C49.9",
    "39": "C50.111",
    "4": "C16.0",
    "40": "C50.112",
    "41": "C50.211",
    "42": "C50.212",
    "43": "C50.311",
    "44": "C50.312",
    "45": "C50.411",
    "46": "C50.412",
    "47": "C50.511",
    "48": "C50.512",
    "49": "C50.811",
    "5": "C16.9",
    "50": "C50.812",
    "51": "C50.911",
    "52": "C50.912",
    "53": "C50.919",
    "54": "C53.9",
    "55": "C54.1",
    "56": "C55",
    "57": "C56.1",
    "58": "C56.2",
    "59": "C56.9",
    "6": "C18.0",
    "60": "C61",
    "61": "C64.1",
    "62": "C64.2",
    "63": "C64.9",
    "64": "C67.2",
    "65": "C67.8",
    "66": "C67.9",
    "67": "C71.1",
    "68": "C71.9",
    "69": "C73",
    "7": "C18.2",
    "70": "C76.0",
    "71": "C77.0",
    "72": "C77.1",
    "73": "C77.2",
    "74": "C77.3",
    "75": "C77.9",
    "76": "C78.00",
    "77": "C78.01",
    "78": "C78.02",
    "79": "C78.6",
    "8": "C18.4",
    "80": "C78.7",
    "81": "C79.31",
    "82": "C79.51",
    "83": "C79.89",
    "84": "C79.9",
    "85": "C7A.8",
    "86": "C80.1",
    "87": "C81.90",
    "88": "C83.30",
    "89": "C83.38",
    "9": "C18.6",
    "90": "C83.39",
    "91": "C85.80",
    "92": "C85.90",
    "93": "C88.0",
    "94": "C90.00",
    "95": "C90.01",
    "96": "C90.02",
    "97": "C91.00",
    "98": "C91.01",
    "99": "C91.10"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "C01": 0,
    "C09.9": 1,
    "C15.5": 2,
    "C15.9": 3,
    "C16.0": 4,
    "C16.9": 5,
    "C18.0": 6,
    "C18.2": 7,
    "C18.4": 8,
    "C18.6": 9,
    "C18.7": 10,
    "C18.9": 11,
    "C19": 12,
    "C20": 13,
    "C21.0": 14,
    "C22.0": 15,
    "C22.1": 16,
    "C25.0": 17,
    "C25.1": 18,
    "C25.9": 19,
    "C34.11": 20,
    "C34.12": 21,
    "C34.2": 22,
    "C34.31": 23,
    "C34.32": 24,
    "C34.90": 25,
    "C34.91": 26,
    "C34.92": 27,
    "C43.59": 28,
    "C43.9": 29,
    "C44.311": 30,
    "C44.319": 31,
    "C44.329": 32,
    "C44.41": 33,
    "C44.42": 34,
    "C44.519": 35,
    "C44.622": 36,
    "C44.629": 37,
    "C49.9": 38,
    "C50.111": 39,
    "C50.112": 40,
    "C50.211": 41,
    "C50.212": 42,
    "C50.311": 43,
    "C50.312": 44,
    "C50.411": 45,
    "C50.412": 46,
    "C50.511": 47,
    "C50.512": 48,
    "C50.811": 49,
    "C50.812": 50,
    "C50.911": 51,
    "C50.912": 52,
    "C50.919": 53,
    "C53.9": 54,
    "C54.1": 55,
    "C55": 56,
    "C56.1": 57,
    "C56.2": 58,
    "C56.9": 59,
    "C61": 60,
    "C64.1": 61,
    "C64.2": 62,
    "C64.9": 63,
    "C67.2": 64,
    "C67.8": 65,
    "C67.9": 66,
    "C71.1": 67,
    "C71.9": 68,
    "C73": 69,
    "C76.0": 70,
    "C77.0": 71,
    "C77.1": 72,
    "C77.2": 73,
    "C77.3": 74,
    "C77.9": 75,
    "C78.00": 76,
    "C78.01": 77,
    "C78.02": 78,
    "C78.6": 79,
    "C78.7": 80,
    "C79.31": 81,
    "C79.51": 82,
    "C79.89": 83,
    "C79.9": 84,
    "C7A.8": 85,
    "C80.1": 86,
    "C81.90": 87,
    "C83.30": 88,
    "C83.38": 89,
    "C83.39": 90,
    "C85.80": 91,
    "C85.90": 92,
    "C88.0": 93,
    "C90.00": 94,
    "C90.01": 95,
    "C90.02": 96,
    "C91.00": 97,
    "C91.01": 98,
    "C91.10": 99,
    "C92.00": 100,
    "C92.01": 101,
    "C92.10": 102
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
