{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "D04.39",
    "1": "D05.11",
    "10": "D12.8",
    "11": "D17.1",
    "12": "D18.01",
    "13": "D22.39",
    "14": "D22.4",
    "15": "D22.5",
    "16": "D22.9",
    "17": "D23.39",
    "18": "D23.5",
    "19": "D23.9",
    "2": "D05.12",
    "20": "D24.1",
    "21": "D24.2",
    "22": "D25.0",
    "23": "D25.1",
    "24": "D25.2",
    "25": "D25.9",
    "26": "D27.0",
    "27": "D27.1",
    "28": "D32.0",
    "29": "D32.9",
    "3": "D06.9",
    "30": "D35.2",
    "31": "D45",
    "32": "D46.9",
    "33": "D47.2",
    "34": "D47.3",
    "35": "D48.5",
    "36": "D49.2",
    "37": "D50.0",
    "38": "D50.8",
    "39": "D50.9",
    "4": "D12.0",
    "40": "D51.0",
    "41": "D51.8",
    "42": "D51.9",
    "43": "D53.9",
    "44": "D57.00",
    "45": "D57.1",
    "46": "D61.810",
    "47": "D61.818",
    "48": "D62",
    "49": "D63.0",
    "5": "D12.2",
    "50": "D63.1",
    "51": "D63.8",
    "52": "D64.81",
    "53": "D64.89",
    "54": "D64.9",
    "55": "D68.51",
    "56": "D68.59",
    "57": "D68.61",
    "58": "D68.8",
    "59": "D68.9",
    "6": "D12.3",
    "60": "D69.3",
    "61": "D69.59",
    "62": "D69.6",
    "63": "D70.1",
    "64": "D70.9",
    "65": "D72.819",
    "66": "D72.829",
    "67": "D75.1",
    "68": "D75.89",
    "69": "D80.1",
    "7": "D12.4",
    "70": "D81.9",
    "71": "D83.9",
    "72": "D84.9",
    "73": "D86.9",
    "74": "D89.89",
    "75": "D89.9",
    "8": "D12.5",
    "9": "D12.6"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "D04.39": 0,
    "D05.11": 1,
    "D05.12": 2,
    "D06.9": 3,
    "D12.0": 4,
    "D12.2": 5,
    "D12.3": 6,
    "D12.4": 7,
    "D12.5": 8,
    "D12.6": 9,
    "D12.8": 10,
    "D17.1": 11,
    "D18.01": 12,
    "D22.39": 13,
    "D22.4": 14,
    "D22.5": 15,
    "D22.9": 16,
    "D23.39": 17,
    "D23.5": 18,
    "D23.9": 19,
    "D24.1": 20,
    "D24.2": 21,
    "D25.0": 22,
    "D25.1": 23,
    "D25.2": 24,
    "D25.9": 25,
    "D27.0": 26,
    "D27.1": 27,
    "D32.0": 28,
    "D32.9": 29,
    "D35.2": 30,
    "D45": 31,
    "D46.9": 32,
    "D47.2": 33,
    "D47.3": 34,
    "D48.5": 35,
    "D49.2": 36,
    "D50.0": 37,
    "D50.8": 38,
    "D50.9": 39,
    "D51.0": 40,
    "D51.8": 41,
    "D51.9": 42,
    "D53.9": 43,
    "D57.00": 44,
    "D57.1": 45,
    "D61.810": 46,
    "D61.818": 47,
    "D62": 48,
    "D63.0": 49,
    "D63.1": 50,
    "D63.8": 51,
    "D64.81": 52,
    "D64.89": 53,
    "D64.9": 54,
    "D68.51": 55,
    "D68.59": 56,
    "D68.61": 57,
    "D68.8": 58,
    "D68.9": 59,
    "D69.3": 60,
    "D69.59": 61,
    "D69.6": 62,
    "D70.1": 63,
    "D70.9": 64,
    "D72.819": 65,
    "D72.829": 66,
    "D75.1": 67,
    "D75.89": 68,
    "D80.1": 69,
    "D81.9": 70,
    "D83.9": 71,
    "D84.9": 72,
    "D86.9": 73,
    "D89.89": 74,
    "D89.9": 75
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
