{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "T14.8",
    "1": "T14.8XXA",
    "10": "T81.4XXA",
    "11": "T81.89XA",
    "12": "T82.7XXA",
    "13": "T82.855A",
    "14": "T82.858A",
    "15": "T82.868A",
    "16": "T82.898A",
    "17": "T83.511A",
    "18": "T84.84XA",
    "2": "T14.90",
    "3": "T18.128A",
    "4": "T38.0X5A",
    "5": "T45.1X5A",
    "6": "T78.1XXA",
    "7": "T78.3XXA",
    "8": "T78.40XA",
    "9": "T81.31XA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "T14.8": 0,
    "T14.8XXA": 1,
    "T14.90": 2,
    "T18.128A": 3,
    "T38.0X5A": 4,
    "T45.1X5A": 5,
    "T78.1XXA": 6,
    "T78.3XXA": 7,
    "T78.40XA": 8,
    "T81.31XA": 9,
    "T81.4XXA": 10,
    "T81.89XA": 11,
    "T82.7XXA": 12,
    "T82.855A": 13,
    "T82.858A": 14,
    "T82.868A": 15,
    "T82.898A": 16,
    "T83.511A": 17,
    "T84.84XA": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
