{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B00.9",
    "1": "B02.9",
    "10": "B19.20",
    "11": "B20",
    "12": "B27.90",
    "13": "B34.9",
    "14": "B35.1",
    "15": "B35.3",
    "16": "B35.4",
    "17": "B37.0",
    "18": "B37.2",
    "19": "B37.3",
    "2": "B07.0",
    "20": "B37.81",
    "21": "B37.9",
    "22": "B95.2",
    "23": "B95.61",
    "24": "B95.62",
    "25": "B96.1",
    "26": "B96.20",
    "27": "B96.5",
    "28": "B96.81",
    "29": "B96.89",
    "3": "B07.8",
    "30": "B97.89",
    "31": "B99.9",
    "4": "B07.9",
    "5": "B08.1",
    "6": "B08.4",
    "7": "B18.1",
    "8": "B18.2",
    "9": "B19.10"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B00.9": 0,
    "B02.9": 1,
    "B07.0": 2,
    "B07.8": 3,
    "B07.9": 4,
    "B08.1": 5,
    "B08.4": 6,
    "B18.1": 7,
    "B18.2": 8,
    "B19.10": 9,
    "B19.20": 10,
    "B20": 11,
    "B27.90": 12,
    "B34.9": 13,
    "B35.1": 14,
    "B35.3": 15,
    "B35.4": 16,
    "B37.0": 17,
    "B37.2": 18,
    "B37.3": 19,
    "B37.81": 20,
    "B37.9": 21,
    "B95.2": 22,
    "B95.61": 23,
    "B95.62": 24,
    "B96.1": 25,
    "B96.20": 26,
    "B96.5": 27,
    "B96.81": 28,
    "B96.89": 29,
    "B97.89": 30,
    "B99.9": 31
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
