{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "T14.8XXA",
    "1": "T18.128A",
    "10": "T82.858A",
    "11": "T82.868A",
    "12": "T82.898A",
    "13": "T83.511A",
    "14": "T84.84XA",
    "2": "T38.0X5A",
    "3": "T45.1X5A",
    "4": "T78.3XXA",
    "5": "T78.40XA",
    "6": "T81.31XA",
    "7": "T81.89XA",
    "8": "T82.7XXA",
    "9": "T82.855A"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "T14.8XXA": 0,
    "T18.128A": 1,
    "T38.0X5A": 2,
    "T45.1X5A": 3,
    "T78.3XXA": 4,
    "T78.40XA": 5,
    "T81.31XA": 6,
    "T81.89XA": 7,
    "T82.7XXA": 8,
    "T82.855A": 9,
    "T82.858A": 10,
    "T82.868A": 11,
    "T82.898A": 12,
    "T83.511A": 13,
    "T84.84XA": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
