{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "F01.50",
    "1": "F01.51",
    "10": "F10.129",
    "11": "F10.20",
    "12": "F10.21",
    "13": "F10.229",
    "14": "F10.230",
    "15": "F10.231",
    "16": "F10.239",
    "17": "F11.10",
    "18": "F11.20",
    "19": "F11.21",
    "2": "F02.80",
    "20": "F11.23",
    "21": "F12.10",
    "22": "F12.20",
    "23": "F12.90",
    "24": "F13.20",
    "25": "F14.10",
    "26": "F14.20",
    "27": "F15.10",
    "28": "F15.20",
    "29": "F17.200",
    "3": "F02.81",
    "30": "F17.210",
    "31": "F17.220",
    "32": "F17.290",
    "33": "F19.10",
    "34": "F19.20",
    "35": "F20.0",
    "36": "F20.9",
    "37": "F22",
    "38": "F25.0",
    "39": "F25.1",
    "4": "F03.90",
    "40": "F25.9",
    "41": "F29",
    "42": "F31.2",
    "43": "F31.30",
    "44": "F31.32",
    "45": "F31.4",
    "46": "F31.5",
    "47": "F31.81",
    "48": "F31.9",
    "49": "F32.0",
    "5": "F03.91",
    "50": "F32.1",
    "51": "F32.2",
    "52": "F32.89",
    "53": "F32.9",
    "54": "F32.A",
    "55": "F33.0",
    "56": "F33.1",
    "57": "F33.2",
    "58": "F33.3",
    "59": "F33.41",
    "6": "F05",
    "60": "F33.42",
    "61": "F33.9",
    "62": "F34.1",
    "63": "F34.81",
    "64": "F39",
    "65": "F40.10",
    "66": "F41.0",
    "67": "F41.1",
    "68": "F41.8",
    "69": "F41.9",
    "7": "F07.81",
    "70": "F42.2",
    "71": "F42.9",
    "72": "F43.0",
    "73": "F43.10",
    "74": "F43.12",
    "75": "F43.20",
    "76": "F43.21",
    "77": "F43.22",
    "78": "F43.23",
    "79": "F43.25",
    "8": "F10.10",
    "80": "F43.8",
    "81": "F43.9",
    "82": "F50.01",
    "83": "F50.9",
    "84": "F51.01",
    "85": "F60.3",
    "86": "F80.0",
    "87": "F80.1",
    "88": "F80.2",
    "89": "F80.9",
    "9": "F10.120",
    "90": "F82",
    "91": "F84.0",
    "92": "F88",
    "93": "F90.0",
    "94": "F90.1",
    "95": "F90.2",
    "96": "F90.9",
    "97": "F91.3",
    "98": "F91.9",
    "99": "F98.8"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "F01.50": 0,
    "F01.51": 1,
    "F02.80": 2,
    "F02.81": 3,
    "F03.90": 4,
    "F03.91": 5,
    "F05": 6,
    "F07.81": 7,
    "F10.10": 8,
    "F10.120": 9,
    "F10.129": 10,
    "F10.20": 11,
    "F10.21": 12,
    "F10.229": 13,
    "F10.230": 14,
    "F10.231": 15,
    "F10.239": 16,
    "F11.10": 17,
    "F11.20": 18,
    "F11.21": 19,
    "F11.23": 20,
    "F12.10": 21,
    "F12.20": 22,
    "F12.90": 23,
    "F13.20": 24,
    "F14.10": 25,
    "F14.20": 26,
    "F15.10": 27,
    "F15.20": 28,
    "F17.200": 29,
    "F17.210": 30,
    "F17.220": 31,
    "F17.290": 32,
    "F19.10": 33,
    "F19.20": 34,
    "F20.0": 35,
    "F20.9": 36,
    "F22": 37,
    "F25.0": 38,
    "F25.1": 39,
    "F25.9": 40,
    "F29": 41,
    "F31.2": 42,
    "F31.30": 43,
    "F31.32": 44,
    "F31.4": 45,
    "F31.5": 46,
    "F31.81": 47,
    "F31.9": 48,
    "F32.0": 49,
    "F32.1": 50,
    "F32.2": 51,
    "F32.89": 52,
    "F32.9": 53,
    "F32.A": 54,
    "F33.0": 55,
    "F33.1": 56,
    "F33.2": 57,
    "F33.3": 58,
    "F33.41": 59,
    "F33.42": 60,
    "F33.9": 61,
    "F34.1": 62,
    "F34.81": 63,
    "F39": 64,
    "F40.10": 65,
    "F41.0": 66,
    "F41.1": 67,
    "F41.8": 68,
    "F41.9": 69,
    "F42.2": 70,
    "F42.9": 71,
    "F43.0": 72,
    "F43.10": 73,
    "F43.12": 74,
    "F43.20": 75,
    "F43.21": 76,
    "F43.22": 77,
    "F43.23": 78,
    "F43.25": 79,
    "F43.8": 80,
    "F43.9": 81,
    "F50.01": 82,
    "F50.9": 83,
    "F51.01": 84,
    "F60.3": 85,
    "F80.0": 86,
    "F80.1": 87,
    "F80.2": 88,
    "F80.9": 89,
    "F82": 90,
    "F84.0": 91,
    "F88": 92,
    "F90.0": 93,
    "F90.1": 94,
    "F90.2": 95,
    "F90.9": 96,
    "F91.3": 97,
    "F91.9": 98,
    "F98.8": 99
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
