{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "H02.831",
    "1": "H04.123",
    "10": "H25.11",
    "11": "H25.12",
    "12": "H25.13",
    "13": "H25.811",
    "14": "H25.812",
    "15": "H25.813",
    "16": "H26.491",
    "17": "H26.492",
    "18": "H26.493",
    "19": "H26.9",
    "2": "H10.13",
    "20": "H34.8310",
    "21": "H34.8320",
    "22": "H35.033",
    "23": "H35.30",
    "24": "H35.31",
    "25": "H35.3131",
    "26": "H35.3132",
    "27": "H35.32",
    "28": "H35.3211",
    "29": "H35.3221",
    "3": "H10.31",
    "30": "H35.3231",
    "31": "H35.363",
    "32": "H35.371",
    "33": "H35.372",
    "34": "H35.373",
    "35": "H35.81",
    "36": "H40.003",
    "37": "H40.013",
    "38": "H40.023",
    "39": "H40.033",
    "4": "H10.32",
    "40": "H40.053",
    "41": "H40.1131",
    "42": "H40.1132",
    "43": "H40.1133",
    "44": "H40.11X1",
    "45": "H40.11X2",
    "46": "H40.9",
    "47": "H43.393",
    "48": "H43.811",
    "49": "H43.812",
    "5": "H10.33",
    "50": "H43.813",
    "51": "H52.03",
    "52": "H52.10",
    "53": "H52.13",
    "54": "H52.223",
    "55": "H52.4",
    "56": "H52.7",
    "57": "H53.2",
    "58": "H53.8",
    "59": "H53.9",
    "6": "H10.45",
    "60": "H54.7",
    "61": "H61.21",
    "62": "H61.22",
    "63": "H61.23",
    "64": "H65.01",
    "65": "H65.03",
    "66": "H65.23",
    "67": "H66.001",
    "68": "H66.002",
    "69": "H66.003",
    "7": "H10.9",
    "70": "H66.90",
    "71": "H66.91",
    "72": "H66.92",
    "73": "H66.93",
    "74": "H69.83",
    "75": "H81.10",
    "76": "H81.11",
    "77": "H90.0",
    "78": "H90.3",
    "79": "H90.5",
    "8": "H16.223",
    "80": "H91.90",
    "81": "H91.93",
    "82": "H92.01",
    "83": "H92.02",
    "84": "H92.03",
    "85": "H92.09",
    "86": "H93.13",
    "9": "H25.013"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "H02.831": 0,
    "H04.123": 1,
    "H10.13": 2,
    "H10.31": 3,
    "H10.32": 4,
    "H10.33": 5,
    "H10.45": 6,
    "H10.9": 7,
    "H16.223": 8,
    "H25.013": 9,
    "H25.11": 10,
    "H25.12": 11,
    "H25.13": 12,
    "H25.811": 13,
    "H25.812": 14,
    "H25.813": 15,
    "H26.491": 16,
    "H26.492": 17,
    "H26.493": 18,
    "H26.9": 19,
    "H34.8310": 20,
    "H34.8320": 21,
    "H35.033": 22,
    "H35.30": 23,
    "H35.31": 24,
    "H35.3131": 25,
    "H35.3132": 26,
    "H35.32": 27,
    "H35.3211": 28,
    "H35.3221": 29,
    "H35.3231": 30,
    "H35.363": 31,
    "H35.371": 32,
    "H35.372": 33,
    "H35.373": 34,
    "H35.81": 35,
    "H40.003": 36,
    "H40.013": 37,
    "H40.023": 38,
    "H40.033": 39,
    "H40.053": 40,
    "H40.1131": 41,
    "H40.1132": 42,
    "H40.1133": 43,
    "H40.11X1": 44,
    "H40.11X2": 45,
    "H40.9": 46,
    "H43.393": 47,
    "H43.811": 48,
    "H43.812": 49,
    "H43.813": 50,
    "H52.03": 51,
    "H52.10": 52,
    "H52.13": 53,
    "H52.223": 54,
    "H52.4": 55,
    "H52.7": 56,
    "H53.2": 57,
    "H53.8": 58,
    "H53.9": 59,
    "H54.7": 60,
    "H61.21": 61,
    "H61.22": 62,
    "H61.23": 63,
    "H65.01": 64,
    "H65.03": 65,
    "H65.23": 66,
    "H66.001": 67,
    "H66.002": 68,
    "H66.003": 69,
    "H66.90": 70,
    "H66.91": 71,
    "H66.92": 72,
    "H66.93": 73,
    "H69.83": 74,
    "H81.10": 75,
    "H81.11": 76,
    "H90.0": 77,
    "H90.3": 78,
    "H90.5": 79,
    "H91.90": 80,
    "H91.93": 81,
    "H92.01": 82,
    "H92.02": 83,
    "H92.03": 84,
    "H92.09": 85,
    "H93.13": 86
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
